In [1]:
import os
import pandas as pd

data_dir = "/Users/mac/Desktop/Study/Diploma/data"
ruslana_dir = os.path.join(data_dir, "ruslana")

Ruslana обрабатываю вручную, в связи со спецификой сырых данных. А именно мне не представляется возможным простая автоматизация из-за устройства папки. В целом, можно посмотреть в сторону автоматизации

In [2]:
sorted(os.listdir(os.path.join(ruslana_dir, "RuslanaEmployment")), key=lambda x: x[::-1])

['RuslanaEmployment"year2010".csv',
 'RuslanaEmployment"yy2010".csv',
 'RuslanaEmployment"year2011".csv',
 'RuslanaEmployment"yy2011".csv',
 'RuslanaEmployment"year2012".csv',
 'RuslanaEmployment"yy2012".csv',
 'RuslanaEmployment"year2013".csv',
 'RuslanaEmployment"yy2013".csv',
 'RuslanaEmployment"year2004".csv',
 'RuslanaEmployment"year2014".csv',
 'RuslanaEmployment"yy2014".csv',
 'RuslanaEmployment"year2005".csv',
 'RuslanaEmployment"2015".csv',
 'RuslanaEmployment"year2015".csv',
 'RuslanaEmployment"yy2015".csv',
 'RuslanaEmployment"year2006".csv',
 'RuslanaEmployment"y2016".csv',
 'RuslanaEmployment"yy2016".csv',
 'RuslanaEmployment"year2007".csv',
 'RuslanaEmployment"yy2007".csv',
 'RuslanaEmployment"year2008".csv',
 'RuslanaEmployment"yy2008".csv',
 'RuslanaEmployment"year2009".csv',
 'RuslanaEmployment"yy2009".csv']

In [3]:
COLS = ["inn", "empl", "year"]

## 2005

In [4]:
table_path = os.path.join(ruslana_dir, 'RuslanaEmployment/RuslanaEmployment"year2005".csv')

df = pd.read_csv(table_path)\
        .drop(columns=["Unnamed: 0"])

df.columns = ["name", "inn", "empl", "year"]

print(len(df))

df.head()

393553

          name           inn  empl  year
0         RASA  1.832033e+09     7  2005
1       Tavias  7.719041e+09    12  2005
2    SINTERS M  7.701245e+09     9  2005
3  EKSTRA PROM  7.702531e+09     8  2005
4     MODUL-ES           NaN    15  2005

In [5]:
df.loc[:, COLS].dropna(subset=["inn"])\
    .assign(inn=lambda x: x.inn.astype(int))\
    .to_csv(os.path.join(ruslana_dir, "ruslana_processed/2005.csv"), index=False)

## 2006

In [6]:
table_path = os.path.join(ruslana_dir, 'RuslanaEmployment/RuslanaEmployment"year2006".csv')

df = pd.read_csv(table_path)\
        .drop(columns=["Unnamed: 0"])

df.columns = ["name", "inn", "empl", "year"]

print(len(df))

df.head()

582403

         name           inn  empl  year
0         RLA  7.825706e+09    92  2006
1     PLASTEN  2.634066e+09    27  2006
2       Volga  3.703043e+09    15  2006
3       TITAN  5.260158e+09     2  2006
4  ARTEMIZIYA  7.709664e+09     2  2006

In [7]:
df.loc[:, COLS].dropna(subset=["inn"])\
    .assign(inn=lambda x: x.inn.astype(int))\
    .to_csv(os.path.join(ruslana_dir, "ruslana_processed/2006.csv"), index=False)

## 2007

In [8]:
tables = ['RuslanaEmployment"year2007".csv', 'RuslanaEmployment"yy2007".csv']

df = []
for table in tables:
    item_df = pd.read_csv(os.path.join(ruslana_dir, "RuslanaEmployment", table))\
                .drop(columns=["Unnamed: 0"])
    
    item_df.columns = ["name", "inn", "empl", "year"]
    df.append(item_df)

df = pd.concat(df)

print(len(df))
df.head()

780603

          name           inn  empl  year
0       NYUANS  7.727587e+09     6  2007
1       ARMIKS  5.404285e+09     3  2007
2      GARDMAN  7.116016e+09    17  2007
3        OREAL  7.704618e+09     2  2007
4  DINA-VIZION  7.709270e+09   230  2007

In [9]:
df.loc[:, COLS].dropna(subset=["inn"])\
    .assign(inn=lambda x: x.inn.astype(int))\
    .to_csv(os.path.join(ruslana_dir, "ruslana_processed/2007.csv"), index=False)

## 2008

In [10]:
tables = ['RuslanaEmployment"year2008".csv', 'RuslanaEmployment"yy2008".csv']

df = []
for table in tables:
    item_df = pd.read_csv(os.path.join(ruslana_dir, "RuslanaEmployment", table))\
                .drop(columns=["Unnamed: 0"])
    
    item_df.columns = ["name", "inn", "empl", "year"]
    df.append(item_df)

df = pd.concat(df)

print(len(df))
df.head()

1108359

        name           inn  empl  year
0     Region  5.904129e+09    11  2008
1   VEGA YUG  2.635119e+09     8  2008
2    EMOUSHN  7.727613e+09    10  2008
3  GPSK LAND  7.704131e+09     6  2008
4       KRAF  3.803201e+09    11  2008

In [11]:
df.loc[:, COLS].dropna(subset=["inn"])\
    .assign(inn=lambda x: x.inn.astype(int))\
    .to_csv(os.path.join(ruslana_dir, "ruslana_processed/2008.csv"), index=False)

## 2009

In [12]:
tables = ['RuslanaEmployment"year2009".csv', 'RuslanaEmployment"yy2009".csv']

df = []
for table in tables:
    item_df = pd.read_csv(os.path.join(ruslana_dir, "RuslanaEmployment", table))\
                .drop(columns=["Unnamed: 0"])
    
    item_df.columns = ["name", "inn", "empl", "year"]
    df.append(item_df)

df = pd.concat(df)

print(len(df))
df.head()

1083391

                name           inn  empl  year
0   PROMSTROIMONTAZH  3.666150e+09    18  2009
1  MONTAZHTEKHINVEST  5.258034e+09    19  2009
2            PROTEKH  7.802450e+09     9  2009
3                 2K  7.734128e+09     4  2009
4                BSV  5.835076e+09    10  2009

In [13]:
df.loc[:, COLS].dropna(subset=["inn"])\
    .assign(inn=lambda x: x.inn.astype(int))\
    .to_csv(os.path.join(ruslana_dir, "ruslana_processed/2009.csv"), index=False)

# Join Together

In [15]:
years = [2005, 2006, 2007, 2008, 2009]
tables = [os.path.join(ruslana_dir, "ruslana_processed/{}.csv".format(year)) for year in years]

df = []
for table in tables:
    df.append(pd.read_csv(table))

df = pd.concat(df)

print(len(df))

df.head()

3946725

          inn  empl  year
0  1832032736     7  2005
1  7719041400    12  2005
2  7701244696     9  2005
3  7702530940     8  2005
4  5914013354    31  2005

In [16]:
df.to_parquet(os.path.join(ruslana_dir, "ruslana.parquet"))